In [1]:
# Import libraries
import requests
import pandas as pd
import re

In [22]:
season_fd = ['2001-02','2001-02','2002-03','2002-03']
team_fd = ['Liverpool','West Ham','Liverpool','Manchester City']
pts_fd = [100,80,90,50,]
zipped_fd = list(zip(season_fd, team_fd, pts_fd))

fd=pd.DataFrame(zipped_fd, columns=['season_fd','team_fd', 'pts_fd'])
fd

  season_fd          team_fd  pts_fd
0   2001-02        Liverpool     100
1   2001-02         West Ham      80
2   2002-03        Liverpool      90
3   2002-03  Manchester City      50

In [23]:
season_q = ['2001-02','2002-03','2002-04']
team_q = ['Liverpool','West Ham','Man City']
zipped_q = list(zip(season_q, team_q))

q=pd.DataFrame(zipped_q, columns=['season_q','team_q'])
q

  season_q     team_q
0  2001-02  Liverpool
1  2002-03   West Ham
2  2002-04   Man City

In [24]:
m = pd.merge(fd, q, left_on=['season_fd','team_fd'], right_on=['season_q','team_q'])
m

  season_fd    team_fd  pts_fd season_q     team_q
0   2001-02  Liverpool     100  2001-02  Liverpool

In [26]:
i = pd.merge(fd, q, left_on=['season_fd','team_fd'], right_on=['season_q','team_q'], how='outer')
i

  season_fd          team_fd  pts_fd season_q     team_q
0   2001-02        Liverpool   100.0  2001-02  Liverpool
1   2001-02         West Ham    80.0      NaN        NaN
2   2002-03        Liverpool    90.0      NaN        NaN
3   2002-03  Manchester City    50.0      NaN        NaN
4       NaN              NaN     NaN  2002-03   West Ham
5       NaN              NaN     NaN  2002-04   Man City